(py2) C:\Users\luyfc\Documents\大学\big data\论文1\DeepST-master\scripts\papers\AAAI17\TaxiBJ>python exptTaxiBJ.py 12
Using Theano backend.
loading data...
C:\Users\luyfc\Anaconda3\envs\py2\lib\site-packages\h5py-2.9.0-py2.7-win-amd64.egg\h5py\_hl\dataset.py:313: H5pyDeprecationWarning: dataset.value has been deprecated. Use dataset[()] instead.
  "Use dataset[()] instead.", H5pyDeprecationWarning)
load C:/Users/luyfc/Anaconda3/envs/py2/Lib/site-packages/DeepST-0.0.1-py2.7.egg/deepst/data\CACHE\TaxiBJ_C3_P1_T1.h5 successfully

 days (test):  ['20160310', '20160311', '20160312', '20160313', '20160314', '20160315', '20160316', '20160317', '20160318', '20160319', '20160320', '20160321', '20160322', '20160325', '20160326', '20160327', '20160328', '20160329', '20160331', '20160401', '20160402', '20160403', '20160404', '20160405', '20160406', '20160407', '20160408', '20160409']

elapsed time (loading data): 4.012 seconds

==========
compiling model...
**at the first time, it takes a few minites to compile if you use [Theano] as the backend**
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
input_1 (InputLayer)             (None, 6, 32, 32)     0
____________________________________________________________________________________________________
input_2 (InputLayer)             (None, 2, 32, 32)     0
____________________________________________________________________________________________________
input_3 (InputLayer)             (None, 2, 32, 32)     0
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 64, 32, 32)    3520        input_1[0][0]
____________________________________________________________________________________________________
convolution2d_27 (Convolution2D) (None, 64, 32, 32)    1216        input_2[0][0]
____________________________________________________________________________________________________
convolution2d_53 (Convolution2D) (None, 64, 32, 32)    1216        input_3[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 64, 32, 32)    0           convolution2d_1[0][0]
____________________________________________________________________________________________________
activation_26 (Activation)       (None, 64, 32, 32)    0           convolution2d_27[0][0]
____________________________________________________________________________________________________
activation_51 (Activation)       (None, 64, 32, 32)    0           convolution2d_53[0][0]
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 64, 32, 32)    36928       activation_1[0][0]
____________________________________________________________________________________________________
convolution2d_28 (Convolution2D) (None, 64, 32, 32)    36928       activation_26[0][0]
____________________________________________________________________________________________________
convolution2d_54 (Convolution2D) (None, 64, 32, 32)    36928       activation_51[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 64, 32, 32)    0           convolution2d_2[0][0]
____________________________________________________________________________________________________
activation_27 (Activation)       (None, 64, 32, 32)    0           convolution2d_28[0][0]
____________________________________________________________________________________________________
activation_52 (Activation)       (None, 64, 32, 32)    0           convolution2d_54[0][0]
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 64, 32, 32)    36928       activation_2[0][0]
____________________________________________________________________________________________________
convolution2d_29 (Convolution2D) (None, 64, 32, 32)    36928       activation_27[0][0]
____________________________________________________________________________________________________
convolution2d_55 (Convolution2D) (None, 64, 32, 32)    36928       activation_52[0][0]
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 64, 32, 32)    0           convolution2d_1[0][0]
                                                                   convolution2d_3[0][0]
____________________________________________________________________________________________________
merge_13 (Merge)                 (None, 64, 32, 32)    0           convolution2d_27[0][0]
                                                                   convolution2d_29[0][0]
____________________________________________________________________________________________________
merge_25 (Merge)                 (None, 64, 32, 32)    0           convolution2d_53[0][0]
                                                                   convolution2d_55[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 64, 32, 32)    0           merge_1[0][0]
____________________________________________________________________________________________________
activation_28 (Activation)       (None, 64, 32, 32)    0           merge_13[0][0]
____________________________________________________________________________________________________
activation_53 (Activation)       (None, 64, 32, 32)    0           merge_25[0][0]
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 64, 32, 32)    36928       activation_3[0][0]
____________________________________________________________________________________________________
convolution2d_30 (Convolution2D) (None, 64, 32, 32)    36928       activation_28[0][0]
____________________________________________________________________________________________________
convolution2d_56 (Convolution2D) (None, 64, 32, 32)    36928       activation_53[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 64, 32, 32)    0           convolution2d_4[0][0]
____________________________________________________________________________________________________
activation_29 (Activation)       (None, 64, 32, 32)    0           convolution2d_30[0][0]
____________________________________________________________________________________________________
activation_54 (Activation)       (None, 64, 32, 32)    0           convolution2d_56[0][0]
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 64, 32, 32)    36928       activation_4[0][0]
____________________________________________________________________________________________________
convolution2d_31 (Convolution2D) (None, 64, 32, 32)    36928       activation_29[0][0]
____________________________________________________________________________________________________
convolution2d_57 (Convolution2D) (None, 64, 32, 32)    36928       activation_54[0][0]
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 64, 32, 32)    0           merge_1[0][0]
                                                                   convolution2d_5[0][0]
____________________________________________________________________________________________________
merge_14 (Merge)                 (None, 64, 32, 32)    0           merge_13[0][0]
                                                                   convolution2d_31[0][0]
____________________________________________________________________________________________________
merge_26 (Merge)                 (None, 64, 32, 32)    0           merge_25[0][0]
                                                                   convolution2d_57[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 64, 32, 32)    0           merge_2[0][0]
____________________________________________________________________________________________________
activation_30 (Activation)       (None, 64, 32, 32)    0           merge_14[0][0]
____________________________________________________________________________________________________
activation_55 (Activation)       (None, 64, 32, 32)    0           merge_26[0][0]
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 64, 32, 32)    36928       activation_5[0][0]
____________________________________________________________________________________________________
convolution2d_32 (Convolution2D) (None, 64, 32, 32)    36928       activation_30[0][0]
____________________________________________________________________________________________________
convolution2d_58 (Convolution2D) (None, 64, 32, 32)    36928       activation_55[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 64, 32, 32)    0           convolution2d_6[0][0]
____________________________________________________________________________________________________
activation_31 (Activation)       (None, 64, 32, 32)    0           convolution2d_32[0][0]
____________________________________________________________________________________________________
activation_56 (Activation)       (None, 64, 32, 32)    0           convolution2d_58[0][0]
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 64, 32, 32)    36928       activation_6[0][0]
____________________________________________________________________________________________________
convolution2d_33 (Convolution2D) (None, 64, 32, 32)    36928       activation_31[0][0]
____________________________________________________________________________________________________
convolution2d_59 (Convolution2D) (None, 64, 32, 32)    36928       activation_56[0][0]
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 64, 32, 32)    0           merge_2[0][0]
                                                                   convolution2d_7[0][0]
____________________________________________________________________________________________________
merge_15 (Merge)                 (None, 64, 32, 32)    0           merge_14[0][0]
                                                                   convolution2d_33[0][0]
____________________________________________________________________________________________________
merge_27 (Merge)                 (None, 64, 32, 32)    0           merge_26[0][0]
                                                                   convolution2d_59[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 64, 32, 32)    0           merge_3[0][0]
____________________________________________________________________________________________________
activation_32 (Activation)       (None, 64, 32, 32)    0           merge_15[0][0]
____________________________________________________________________________________________________
activation_57 (Activation)       (None, 64, 32, 32)    0           merge_27[0][0]
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 64, 32, 32)    36928       activation_7[0][0]
____________________________________________________________________________________________________
convolution2d_34 (Convolution2D) (None, 64, 32, 32)    36928       activation_32[0][0]
____________________________________________________________________________________________________
convolution2d_60 (Convolution2D) (None, 64, 32, 32)    36928       activation_57[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 64, 32, 32)    0           convolution2d_8[0][0]
____________________________________________________________________________________________________
activation_33 (Activation)       (None, 64, 32, 32)    0           convolution2d_34[0][0]
____________________________________________________________________________________________________
activation_58 (Activation)       (None, 64, 32, 32)    0           convolution2d_60[0][0]
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 64, 32, 32)    36928       activation_8[0][0]
____________________________________________________________________________________________________
convolution2d_35 (Convolution2D) (None, 64, 32, 32)    36928       activation_33[0][0]
____________________________________________________________________________________________________
convolution2d_61 (Convolution2D) (None, 64, 32, 32)    36928       activation_58[0][0]
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 64, 32, 32)    0           merge_3[0][0]
                                                                   convolution2d_9[0][0]
____________________________________________________________________________________________________
merge_16 (Merge)                 (None, 64, 32, 32)    0           merge_15[0][0]
                                                                   convolution2d_35[0][0]
____________________________________________________________________________________________________
merge_28 (Merge)                 (None, 64, 32, 32)    0           merge_27[0][0]
                                                                   convolution2d_61[0][0]
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 64, 32, 32)    0           merge_4[0][0]
____________________________________________________________________________________________________
activation_34 (Activation)       (None, 64, 32, 32)    0           merge_16[0][0]
____________________________________________________________________________________________________
activation_59 (Activation)       (None, 64, 32, 32)    0           merge_28[0][0]
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 64, 32, 32)    36928       activation_9[0][0]
____________________________________________________________________________________________________
convolution2d_36 (Convolution2D) (None, 64, 32, 32)    36928       activation_34[0][0]
____________________________________________________________________________________________________
convolution2d_62 (Convolution2D) (None, 64, 32, 32)    36928       activation_59[0][0]
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 64, 32, 32)    0           convolution2d_10[0][0]
____________________________________________________________________________________________________
activation_35 (Activation)       (None, 64, 32, 32)    0           convolution2d_36[0][0]
____________________________________________________________________________________________________
activation_60 (Activation)       (None, 64, 32, 32)    0           convolution2d_62[0][0]
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 64, 32, 32)    36928       activation_10[0][0]
____________________________________________________________________________________________________
convolution2d_37 (Convolution2D) (None, 64, 32, 32)    36928       activation_35[0][0]
____________________________________________________________________________________________________
convolution2d_63 (Convolution2D) (None, 64, 32, 32)    36928       activation_60[0][0]
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 64, 32, 32)    0           merge_4[0][0]
                                                                   convolution2d_11[0][0]
____________________________________________________________________________________________________
merge_17 (Merge)                 (None, 64, 32, 32)    0           merge_16[0][0]
                                                                   convolution2d_37[0][0]
____________________________________________________________________________________________________
merge_29 (Merge)                 (None, 64, 32, 32)    0           merge_28[0][0]
                                                                   convolution2d_63[0][0]
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 64, 32, 32)    0           merge_5[0][0]
____________________________________________________________________________________________________
activation_36 (Activation)       (None, 64, 32, 32)    0           merge_17[0][0]
____________________________________________________________________________________________________
activation_61 (Activation)       (None, 64, 32, 32)    0           merge_29[0][0]
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 64, 32, 32)    36928       activation_11[0][0]
____________________________________________________________________________________________________
convolution2d_38 (Convolution2D) (None, 64, 32, 32)    36928       activation_36[0][0]
____________________________________________________________________________________________________
convolution2d_64 (Convolution2D) (None, 64, 32, 32)    36928       activation_61[0][0]
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 64, 32, 32)    0           convolution2d_12[0][0]
____________________________________________________________________________________________________
activation_37 (Activation)       (None, 64, 32, 32)    0           convolution2d_38[0][0]
____________________________________________________________________________________________________
activation_62 (Activation)       (None, 64, 32, 32)    0           convolution2d_64[0][0]
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 64, 32, 32)    36928       activation_12[0][0]
____________________________________________________________________________________________________
convolution2d_39 (Convolution2D) (None, 64, 32, 32)    36928       activation_37[0][0]
____________________________________________________________________________________________________
convolution2d_65 (Convolution2D) (None, 64, 32, 32)    36928       activation_62[0][0]
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 64, 32, 32)    0           merge_5[0][0]
                                                                   convolution2d_13[0][0]
____________________________________________________________________________________________________
merge_18 (Merge)                 (None, 64, 32, 32)    0           merge_17[0][0]
                                                                   convolution2d_39[0][0]
____________________________________________________________________________________________________
merge_30 (Merge)                 (None, 64, 32, 32)    0           merge_29[0][0]
                                                                   convolution2d_65[0][0]
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 64, 32, 32)    0           merge_6[0][0]
____________________________________________________________________________________________________
activation_38 (Activation)       (None, 64, 32, 32)    0           merge_18[0][0]
____________________________________________________________________________________________________
activation_63 (Activation)       (None, 64, 32, 32)    0           merge_30[0][0]
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, 64, 32, 32)    36928       activation_13[0][0]
____________________________________________________________________________________________________
convolution2d_40 (Convolution2D) (None, 64, 32, 32)    36928       activation_38[0][0]
____________________________________________________________________________________________________
convolution2d_66 (Convolution2D) (None, 64, 32, 32)    36928       activation_63[0][0]
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 64, 32, 32)    0           convolution2d_14[0][0]
____________________________________________________________________________________________________
activation_39 (Activation)       (None, 64, 32, 32)    0           convolution2d_40[0][0]
____________________________________________________________________________________________________
activation_64 (Activation)       (None, 64, 32, 32)    0           convolution2d_66[0][0]
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, 64, 32, 32)    36928       activation_14[0][0]
____________________________________________________________________________________________________
convolution2d_41 (Convolution2D) (None, 64, 32, 32)    36928       activation_39[0][0]
____________________________________________________________________________________________________
convolution2d_67 (Convolution2D) (None, 64, 32, 32)    36928       activation_64[0][0]
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 64, 32, 32)    0           merge_6[0][0]
                                                                   convolution2d_15[0][0]
____________________________________________________________________________________________________
merge_19 (Merge)                 (None, 64, 32, 32)    0           merge_18[0][0]
                                                                   convolution2d_41[0][0]
____________________________________________________________________________________________________
merge_31 (Merge)                 (None, 64, 32, 32)    0           merge_30[0][0]
                                                                   convolution2d_67[0][0]
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 64, 32, 32)    0           merge_7[0][0]
____________________________________________________________________________________________________
activation_40 (Activation)       (None, 64, 32, 32)    0           merge_19[0][0]
____________________________________________________________________________________________________
activation_65 (Activation)       (None, 64, 32, 32)    0           merge_31[0][0]
____________________________________________________________________________________________________
convolution2d_16 (Convolution2D) (None, 64, 32, 32)    36928       activation_15[0][0]
____________________________________________________________________________________________________
convolution2d_42 (Convolution2D) (None, 64, 32, 32)    36928       activation_40[0][0]
____________________________________________________________________________________________________
convolution2d_68 (Convolution2D) (None, 64, 32, 32)    36928       activation_65[0][0]
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 64, 32, 32)    0           convolution2d_16[0][0]
____________________________________________________________________________________________________
activation_41 (Activation)       (None, 64, 32, 32)    0           convolution2d_42[0][0]
____________________________________________________________________________________________________
activation_66 (Activation)       (None, 64, 32, 32)    0           convolution2d_68[0][0]
____________________________________________________________________________________________________
convolution2d_17 (Convolution2D) (None, 64, 32, 32)    36928       activation_16[0][0]
____________________________________________________________________________________________________
convolution2d_43 (Convolution2D) (None, 64, 32, 32)    36928       activation_41[0][0]
____________________________________________________________________________________________________
convolution2d_69 (Convolution2D) (None, 64, 32, 32)    36928       activation_66[0][0]
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 64, 32, 32)    0           merge_7[0][0]
                                                                   convolution2d_17[0][0]
____________________________________________________________________________________________________
merge_20 (Merge)                 (None, 64, 32, 32)    0           merge_19[0][0]
                                                                   convolution2d_43[0][0]
____________________________________________________________________________________________________
merge_32 (Merge)                 (None, 64, 32, 32)    0           merge_31[0][0]
                                                                   convolution2d_69[0][0]
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 64, 32, 32)    0           merge_8[0][0]
____________________________________________________________________________________________________
activation_42 (Activation)       (None, 64, 32, 32)    0           merge_20[0][0]
____________________________________________________________________________________________________
activation_67 (Activation)       (None, 64, 32, 32)    0           merge_32[0][0]
____________________________________________________________________________________________________
convolution2d_18 (Convolution2D) (None, 64, 32, 32)    36928       activation_17[0][0]
____________________________________________________________________________________________________
convolution2d_44 (Convolution2D) (None, 64, 32, 32)    36928       activation_42[0][0]
____________________________________________________________________________________________________
convolution2d_70 (Convolution2D) (None, 64, 32, 32)    36928       activation_67[0][0]
____________________________________________________________________________________________________
activation_18 (Activation)       (None, 64, 32, 32)    0           convolution2d_18[0][0]
____________________________________________________________________________________________________
activation_43 (Activation)       (None, 64, 32, 32)    0           convolution2d_44[0][0]
____________________________________________________________________________________________________
activation_68 (Activation)       (None, 64, 32, 32)    0           convolution2d_70[0][0]
____________________________________________________________________________________________________
convolution2d_19 (Convolution2D) (None, 64, 32, 32)    36928       activation_18[0][0]
____________________________________________________________________________________________________
convolution2d_45 (Convolution2D) (None, 64, 32, 32)    36928       activation_43[0][0]
____________________________________________________________________________________________________
convolution2d_71 (Convolution2D) (None, 64, 32, 32)    36928       activation_68[0][0]
____________________________________________________________________________________________________
merge_9 (Merge)                  (None, 64, 32, 32)    0           merge_8[0][0]
                                                                   convolution2d_19[0][0]
____________________________________________________________________________________________________
merge_21 (Merge)                 (None, 64, 32, 32)    0           merge_20[0][0]
                                                                   convolution2d_45[0][0]
____________________________________________________________________________________________________
merge_33 (Merge)                 (None, 64, 32, 32)    0           merge_32[0][0]
                                                                   convolution2d_71[0][0]
____________________________________________________________________________________________________
activation_19 (Activation)       (None, 64, 32, 32)    0           merge_9[0][0]
____________________________________________________________________________________________________
activation_44 (Activation)       (None, 64, 32, 32)    0           merge_21[0][0]
____________________________________________________________________________________________________
activation_69 (Activation)       (None, 64, 32, 32)    0           merge_33[0][0]
____________________________________________________________________________________________________
convolution2d_20 (Convolution2D) (None, 64, 32, 32)    36928       activation_19[0][0]
____________________________________________________________________________________________________
convolution2d_46 (Convolution2D) (None, 64, 32, 32)    36928       activation_44[0][0]
____________________________________________________________________________________________________
convolution2d_72 (Convolution2D) (None, 64, 32, 32)    36928       activation_69[0][0]
____________________________________________________________________________________________________
activation_20 (Activation)       (None, 64, 32, 32)    0           convolution2d_20[0][0]
____________________________________________________________________________________________________
activation_45 (Activation)       (None, 64, 32, 32)    0           convolution2d_46[0][0]
____________________________________________________________________________________________________
activation_70 (Activation)       (None, 64, 32, 32)    0           convolution2d_72[0][0]
____________________________________________________________________________________________________
convolution2d_21 (Convolution2D) (None, 64, 32, 32)    36928       activation_20[0][0]
____________________________________________________________________________________________________
convolution2d_47 (Convolution2D) (None, 64, 32, 32)    36928       activation_45[0][0]
____________________________________________________________________________________________________
convolution2d_73 (Convolution2D) (None, 64, 32, 32)    36928       activation_70[0][0]
____________________________________________________________________________________________________
merge_10 (Merge)                 (None, 64, 32, 32)    0           merge_9[0][0]
                                                                   convolution2d_21[0][0]
____________________________________________________________________________________________________
merge_22 (Merge)                 (None, 64, 32, 32)    0           merge_21[0][0]
                                                                   convolution2d_47[0][0]
____________________________________________________________________________________________________
merge_34 (Merge)                 (None, 64, 32, 32)    0           merge_33[0][0]
                                                                   convolution2d_73[0][0]
____________________________________________________________________________________________________
activation_21 (Activation)       (None, 64, 32, 32)    0           merge_10[0][0]
____________________________________________________________________________________________________
activation_46 (Activation)       (None, 64, 32, 32)    0           merge_22[0][0]
____________________________________________________________________________________________________
activation_71 (Activation)       (None, 64, 32, 32)    0           merge_34[0][0]
____________________________________________________________________________________________________
convolution2d_22 (Convolution2D) (None, 64, 32, 32)    36928       activation_21[0][0]
____________________________________________________________________________________________________
convolution2d_48 (Convolution2D) (None, 64, 32, 32)    36928       activation_46[0][0]
____________________________________________________________________________________________________
convolution2d_74 (Convolution2D) (None, 64, 32, 32)    36928       activation_71[0][0]
____________________________________________________________________________________________________
activation_22 (Activation)       (None, 64, 32, 32)    0           convolution2d_22[0][0]
____________________________________________________________________________________________________
activation_47 (Activation)       (None, 64, 32, 32)    0           convolution2d_48[0][0]
____________________________________________________________________________________________________
activation_72 (Activation)       (None, 64, 32, 32)    0           convolution2d_74[0][0]
____________________________________________________________________________________________________
convolution2d_23 (Convolution2D) (None, 64, 32, 32)    36928       activation_22[0][0]
____________________________________________________________________________________________________
convolution2d_49 (Convolution2D) (None, 64, 32, 32)    36928       activation_47[0][0]
____________________________________________________________________________________________________
convolution2d_75 (Convolution2D) (None, 64, 32, 32)    36928       activation_72[0][0]
____________________________________________________________________________________________________
merge_11 (Merge)                 (None, 64, 32, 32)    0           merge_10[0][0]
                                                                   convolution2d_23[0][0]
____________________________________________________________________________________________________
merge_23 (Merge)                 (None, 64, 32, 32)    0           merge_22[0][0]
                                                                   convolution2d_49[0][0]
____________________________________________________________________________________________________
merge_35 (Merge)                 (None, 64, 32, 32)    0           merge_34[0][0]
                                                                   convolution2d_75[0][0]
____________________________________________________________________________________________________
activation_23 (Activation)       (None, 64, 32, 32)    0           merge_11[0][0]
____________________________________________________________________________________________________
activation_48 (Activation)       (None, 64, 32, 32)    0           merge_23[0][0]
____________________________________________________________________________________________________
activation_73 (Activation)       (None, 64, 32, 32)    0           merge_35[0][0]
____________________________________________________________________________________________________
convolution2d_24 (Convolution2D) (None, 64, 32, 32)    36928       activation_23[0][0]
____________________________________________________________________________________________________
convolution2d_50 (Convolution2D) (None, 64, 32, 32)    36928       activation_48[0][0]
____________________________________________________________________________________________________
convolution2d_76 (Convolution2D) (None, 64, 32, 32)    36928       activation_73[0][0]
____________________________________________________________________________________________________
activation_24 (Activation)       (None, 64, 32, 32)    0           convolution2d_24[0][0]
____________________________________________________________________________________________________
activation_49 (Activation)       (None, 64, 32, 32)    0           convolution2d_50[0][0]
____________________________________________________________________________________________________
activation_74 (Activation)       (None, 64, 32, 32)    0           convolution2d_76[0][0]
____________________________________________________________________________________________________
convolution2d_25 (Convolution2D) (None, 64, 32, 32)    36928       activation_24[0][0]
____________________________________________________________________________________________________
convolution2d_51 (Convolution2D) (None, 64, 32, 32)    36928       activation_49[0][0]
____________________________________________________________________________________________________
convolution2d_77 (Convolution2D) (None, 64, 32, 32)    36928       activation_74[0][0]
____________________________________________________________________________________________________
input_4 (InputLayer)             (None, 28)            0
____________________________________________________________________________________________________
merge_12 (Merge)                 (None, 64, 32, 32)    0           merge_11[0][0]
                                                                   convolution2d_25[0][0]
____________________________________________________________________________________________________
merge_24 (Merge)                 (None, 64, 32, 32)    0           merge_23[0][0]
                                                                   convolution2d_51[0][0]
____________________________________________________________________________________________________
merge_36 (Merge)                 (None, 64, 32, 32)    0           merge_35[0][0]
                                                                   convolution2d_77[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 10)            290         input_4[0][0]
____________________________________________________________________________________________________
activation_25 (Activation)       (None, 64, 32, 32)    0           merge_12[0][0]
____________________________________________________________________________________________________
activation_50 (Activation)       (None, 64, 32, 32)    0           merge_24[0][0]
____________________________________________________________________________________________________
activation_75 (Activation)       (None, 64, 32, 32)    0           merge_36[0][0]
____________________________________________________________________________________________________
activation_76 (Activation)       (None, 10)            0           dense_1[0][0]
____________________________________________________________________________________________________
convolution2d_26 (Convolution2D) (None, 2, 32, 32)     1154        activation_25[0][0]
____________________________________________________________________________________________________
convolution2d_52 (Convolution2D) (None, 2, 32, 32)     1154        activation_50[0][0]
____________________________________________________________________________________________________
convolution2d_78 (Convolution2D) (None, 2, 32, 32)     1154        activation_75[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 2048)          22528       activation_76[0][0]
____________________________________________________________________________________________________
ilayer_1 (iLayer)                (None, 2, 32, 32)     2048        convolution2d_26[0][0]
____________________________________________________________________________________________________
ilayer_2 (iLayer)                (None, 2, 32, 32)     2048        convolution2d_52[0][0]
____________________________________________________________________________________________________
ilayer_3 (iLayer)                (None, 2, 32, 32)     2048        convolution2d_78[0][0]
____________________________________________________________________________________________________
activation_77 (Activation)       (None, 2048)          0           dense_2[0][0]
____________________________________________________________________________________________________
merge_37 (Merge)                 (None, 2, 32, 32)     0           ilayer_1[0][0]
                                                                   ilayer_2[0][0]
                                                                   ilayer_3[0][0]
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 2, 32, 32)     0           activation_77[0][0]
____________________________________________________________________________________________________
merge_38 (Merge)                 (None, 2, 32, 32)     0           merge_37[0][0]
                                                                   reshape_1[0][0]
____________________________________________________________________________________________________
activation_78 (Activation)       (None, 2, 32, 32)     0           merge_38[0][0]
====================================================================================================
Total params: 2,697,192
Trainable params: 2,697,192
Non-trainable params: 0
____________________________________________________________________________________________________

elapsed time (compiling model): 21.119 seconds

==========
training model...
Train on 12355 samples, validate on 1373 samples
Epoch 1/500
 9984/12355 [=======================>......] - ETA: 1987s - loss: 0.0245 - rmse: 0.1212Traceback (most recent call last):