(py2) C:\Users\luyfc\Documents\大学\big data\论文1\DeepST-master\scripts\papers\AAAI17\BikeNYC>python exptBikeNYC.py
Using Theano backend.
c:\users\luyfc\documents\大学\big data\论文1\deepst-master\deepst\..\data
factor:  1.25707872211
loading data...
C:\Users\luyfc\Anaconda3\envs\py2\lib\site-packages\h5py-2.9.0-py2.7-win-amd64.egg\h5py\_hl\dataset.py:313: H5pyDeprecationWarning: dataset.value has been deprecated. Use dataset[()] instead.
  "Use dataset[()] instead.", H5pyDeprecationWarning)
('incomplete days: ', [])
train_data shape:  (4152L, 2L, 16L, 8L)
min: 0.0 max: 267.0
XC shape:  (3720L, 6L, 16L, 8L) XP shape:  (3720L, 8L, 16L, 8L) XT shape:  (3720L, 8L, 16L, 8L) Y shape: (3720L, 2L, 16L, 8L)
XC shape:  (3720L, 6L, 16L, 8L) XP shape:  (3720L, 8L, 16L, 8L) XT shape:  (3720L, 8L, 16L, 8L) Y shape: (3720L, 2L, 16L, 8L)
train shape: (3480L, 6L, 16L, 8L) (3480L, 2L, 16L, 8L) test shape:  (240L, 6L, 16L, 8L) (240L, 2L, 16L, 8L)
(3480L, 6L, 16L, 8L)
(3480L, 8L, 16L, 8L)
(3480L, 8L, 16L, 8L)
(3480L, 8L)

(240L, 6L, 16L, 8L)
(240L, 8L, 16L, 8L)
(240L, 8L, 16L, 8L)
(240L, 8L)


 days (test):  ['20140921', '20140922', '20140923', '20140924', '20140925', '20140926', '20140927', '20140928', '20140929', '20140930']
==========
compiling model...
**at the first time, it takes a few minites to compile if you use [Theano] as the backend**
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
input_1 (InputLayer)             (None, 6, 16, 8)      0
____________________________________________________________________________________________________
input_2 (InputLayer)             (None, 8, 16, 8)      0
____________________________________________________________________________________________________
input_3 (InputLayer)             (None, 8, 16, 8)      0
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 64, 16, 8)     3520        input_1[0][0]
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 64, 16, 8)     4672        input_2[0][0]
____________________________________________________________________________________________________
convolution2d_21 (Convolution2D) (None, 64, 16, 8)     4672        input_3[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 64, 16, 8)     0           convolution2d_1[0][0]
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 64, 16, 8)     0           convolution2d_11[0][0]
____________________________________________________________________________________________________
activation_19 (Activation)       (None, 64, 16, 8)     0           convolution2d_21[0][0]
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 64, 16, 8)     36928       activation_1[0][0]
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 64, 16, 8)     36928       activation_10[0][0]
____________________________________________________________________________________________________
convolution2d_22 (Convolution2D) (None, 64, 16, 8)     36928       activation_19[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 64, 16, 8)     0           convolution2d_2[0][0]
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 64, 16, 8)     0           convolution2d_12[0][0]
____________________________________________________________________________________________________
activation_20 (Activation)       (None, 64, 16, 8)     0           convolution2d_22[0][0]
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 64, 16, 8)     36928       activation_2[0][0]
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 64, 16, 8)     36928       activation_11[0][0]
____________________________________________________________________________________________________
convolution2d_23 (Convolution2D) (None, 64, 16, 8)     36928       activation_20[0][0]
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 64, 16, 8)     0           convolution2d_1[0][0]
                                                                   convolution2d_3[0][0]
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 64, 16, 8)     0           convolution2d_11[0][0]
                                                                   convolution2d_13[0][0]
____________________________________________________________________________________________________
merge_9 (Merge)                  (None, 64, 16, 8)     0           convolution2d_21[0][0]
                                                                   convolution2d_23[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 64, 16, 8)     0           merge_1[0][0]
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 64, 16, 8)     0           merge_5[0][0]
____________________________________________________________________________________________________
activation_21 (Activation)       (None, 64, 16, 8)     0           merge_9[0][0]
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 64, 16, 8)     36928       activation_3[0][0]
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, 64, 16, 8)     36928       activation_12[0][0]
____________________________________________________________________________________________________
convolution2d_24 (Convolution2D) (None, 64, 16, 8)     36928       activation_21[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 64, 16, 8)     0           convolution2d_4[0][0]
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 64, 16, 8)     0           convolution2d_14[0][0]
____________________________________________________________________________________________________
activation_22 (Activation)       (None, 64, 16, 8)     0           convolution2d_24[0][0]
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 64, 16, 8)     36928       activation_4[0][0]
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, 64, 16, 8)     36928       activation_13[0][0]
____________________________________________________________________________________________________
convolution2d_25 (Convolution2D) (None, 64, 16, 8)     36928       activation_22[0][0]
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 64, 16, 8)     0           merge_1[0][0]
                                                                   convolution2d_5[0][0]
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 64, 16, 8)     0           merge_5[0][0]
                                                                   convolution2d_15[0][0]
____________________________________________________________________________________________________
merge_10 (Merge)                 (None, 64, 16, 8)     0           merge_9[0][0]
                                                                   convolution2d_25[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 64, 16, 8)     0           merge_2[0][0]
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 64, 16, 8)     0           merge_6[0][0]
____________________________________________________________________________________________________
activation_23 (Activation)       (None, 64, 16, 8)     0           merge_10[0][0]
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 64, 16, 8)     36928       activation_5[0][0]
____________________________________________________________________________________________________
convolution2d_16 (Convolution2D) (None, 64, 16, 8)     36928       activation_14[0][0]
____________________________________________________________________________________________________
convolution2d_26 (Convolution2D) (None, 64, 16, 8)     36928       activation_23[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 64, 16, 8)     0           convolution2d_6[0][0]
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 64, 16, 8)     0           convolution2d_16[0][0]
____________________________________________________________________________________________________
activation_24 (Activation)       (None, 64, 16, 8)     0           convolution2d_26[0][0]
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 64, 16, 8)     36928       activation_6[0][0]
____________________________________________________________________________________________________
convolution2d_17 (Convolution2D) (None, 64, 16, 8)     36928       activation_15[0][0]
____________________________________________________________________________________________________
convolution2d_27 (Convolution2D) (None, 64, 16, 8)     36928       activation_24[0][0]
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 64, 16, 8)     0           merge_2[0][0]
                                                                   convolution2d_7[0][0]
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 64, 16, 8)     0           merge_6[0][0]
                                                                   convolution2d_17[0][0]
____________________________________________________________________________________________________
merge_11 (Merge)                 (None, 64, 16, 8)     0           merge_10[0][0]
                                                                   convolution2d_27[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 64, 16, 8)     0           merge_3[0][0]
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 64, 16, 8)     0           merge_7[0][0]
____________________________________________________________________________________________________
activation_25 (Activation)       (None, 64, 16, 8)     0           merge_11[0][0]
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 64, 16, 8)     36928       activation_7[0][0]
____________________________________________________________________________________________________
convolution2d_18 (Convolution2D) (None, 64, 16, 8)     36928       activation_16[0][0]
____________________________________________________________________________________________________
convolution2d_28 (Convolution2D) (None, 64, 16, 8)     36928       activation_25[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 64, 16, 8)     0           convolution2d_8[0][0]
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 64, 16, 8)     0           convolution2d_18[0][0]
____________________________________________________________________________________________________
activation_26 (Activation)       (None, 64, 16, 8)     0           convolution2d_28[0][0]
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 64, 16, 8)     36928       activation_8[0][0]
____________________________________________________________________________________________________
convolution2d_19 (Convolution2D) (None, 64, 16, 8)     36928       activation_17[0][0]
____________________________________________________________________________________________________
convolution2d_29 (Convolution2D) (None, 64, 16, 8)     36928       activation_26[0][0]
____________________________________________________________________________________________________
input_4 (InputLayer)             (None, 8L)            0
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 64, 16, 8)     0           merge_3[0][0]
                                                                   convolution2d_9[0][0]
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 64, 16, 8)     0           merge_7[0][0]
                                                                   convolution2d_19[0][0]
____________________________________________________________________________________________________
merge_12 (Merge)                 (None, 64, 16, 8)     0           merge_11[0][0]
                                                                   convolution2d_29[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 10)            90          input_4[0][0]
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 64, 16, 8)     0           merge_4[0][0]
____________________________________________________________________________________________________
activation_18 (Activation)       (None, 64, 16, 8)     0           merge_8[0][0]
____________________________________________________________________________________________________
activation_27 (Activation)       (None, 64, 16, 8)     0           merge_12[0][0]
____________________________________________________________________________________________________
activation_28 (Activation)       (None, 10)            0           dense_1[0][0]
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 2, 16, 8)      1154        activation_9[0][0]
____________________________________________________________________________________________________
convolution2d_20 (Convolution2D) (None, 2, 16, 8)      1154        activation_18[0][0]
____________________________________________________________________________________________________
convolution2d_30 (Convolution2D) (None, 2, 16, 8)      1154        activation_27[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 256)           2816        activation_28[0][0]
____________________________________________________________________________________________________
ilayer_1 (iLayer)                (None, 2, 16, 8)      256         convolution2d_10[0][0]
____________________________________________________________________________________________________
ilayer_2 (iLayer)                (None, 2, 16, 8)      256         convolution2d_20[0][0]
____________________________________________________________________________________________________
ilayer_3 (iLayer)                (None, 2, 16, 8)      256         convolution2d_30[0][0]
____________________________________________________________________________________________________
activation_29 (Activation)       (None, 256)           0           dense_2[0][0]
____________________________________________________________________________________________________
merge_13 (Merge)                 (None, 2, 16, 8)      0           ilayer_1[0][0]
                                                                   ilayer_2[0][0]
                                                                   ilayer_3[0][0]
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 2, 16, 8)      0           activation_29[0][0]
____________________________________________________________________________________________________
merge_14 (Merge)                 (None, 2, 16, 8)      0           merge_13[0][0]
                                                                   reshape_1[0][0]
____________________________________________________________________________________________________
activation_30 (Activation)       (None, 2, 16, 8)      0           merge_14[0][0]
====================================================================================================
Total params: 906,272
Trainable params: 906,272
Non-trainable params: 0
____________________________________________________________________________________________________
==========
training model...
Train on 3132 samples, validate on 348 samples
Epoch 1/500
3132/3132 [==============================] - 140s - loss: 0.0409 - rmse: 0.1712 - val_loss: 0.0141 - val_rmse: 0.1176
Epoch 2/500
3132/3132 [==============================] - 155s - loss: 0.0078 - rmse: 0.0875 - val_loss: 0.0067 - val_rmse: 0.0816
Epoch 3/500
3132/3132 [==============================] - 145s - loss: 0.0050 - rmse: 0.0700 - val_loss: 0.0043 - val_rmse: 0.0657
Epoch 4/500
3132/3132 [==============================] - 145s - loss: 0.0039 - rmse: 0.0621 - val_loss: 0.0038 - val_rmse: 0.0618
Epoch 5/500
3132/3132 [==============================] - 155s - loss: 0.0034 - rmse: 0.0584 - val_loss: 0.0034 - val_rmse: 0.0577
Epoch 6/500
3132/3132 [==============================] - 146s - loss: 0.0030 - rmse: 0.0545 - val_loss: 0.0030 - val_rmse: 0.0550
Epoch 7/500
3132/3132 [==============================] - 147s - loss: 0.0028 - rmse: 0.0522 - val_loss: 0.0028 - val_rmse: 0.0530
Epoch 8/500
3132/3132 [==============================] - 151s - loss: 0.0026 - rmse: 0.0506 - val_loss: 0.0027 - val_rmse: 0.0515
Epoch 9/500
3132/3132 [==============================] - 149s - loss: 0.0025 - rmse: 0.0494 - val_loss: 0.0027 - val_rmse: 0.0515
Epoch 10/500
3132/3132 [==============================] - 149s - loss: 0.0024 - rmse: 0.0486 - val_loss: 0.0027 - val_rmse: 0.0515
Epoch 11/500
3132/3132 [==============================] - 159s - loss: 0.0025 - rmse: 0.0493 - val_loss: 0.0025 - val_rmse: 0.0496
Epoch 12/500
3132/3132 [==============================] - 156s - loss: 0.0023 - rmse: 0.0473 - val_loss: 0.0024 - val_rmse: 0.0489
Epoch 13/500
3132/3132 [==============================] - 152s - loss: 0.0023 - rmse: 0.0478 - val_loss: 0.0025 - val_rmse: 0.0498
Epoch 14/500
3132/3132 [==============================] - 155s - loss: 0.0022 - rmse: 0.0472 - val_loss: 0.0026 - val_rmse: 0.0512
Epoch 15/500
3132/3132 [==============================] - 159s - loss: 0.0024 - rmse: 0.0483 - val_loss: 0.0024 - val_rmse: 0.0485
Epoch 16/500
3132/3132 [==============================] - 146s - loss: 0.0021 - rmse: 0.0456 - val_loss: 0.0023 - val_rmse: 0.0476
Epoch 17/500
3132/3132 [==============================] - 154s - loss: 0.0021 - rmse: 0.0453 - val_loss: 0.0023 - val_rmse: 0.0483
Epoch 18/500
3132/3132 [==============================] - 159s - loss: 0.0020 - rmse: 0.0450 - val_loss: 0.0022 - val_rmse: 0.0468
Epoch 19/500
3132/3132 [==============================] - 152s - loss: 0.0020 - rmse: 0.0447 - val_loss: 0.0024 - val_rmse: 0.0483
Epoch 20/500
3132/3132 [==============================] - 161s - loss: 0.0020 - rmse: 0.0448 - val_loss: 0.0023 - val_rmse: 0.0474
Epoch 21/500
3132/3132 [==============================] - 166s - loss: 0.0020 - rmse: 0.0447 - val_loss: 0.0022 - val_rmse: 0.0466
Epoch 22/500
3132/3132 [==============================] - 165s - loss: 0.0021 - rmse: 0.0453 - val_loss: 0.0027 - val_rmse: 0.0516
Epoch 23/500
3132/3132 [==============================] - 165s - loss: 0.0020 - rmse: 0.0442 - val_loss: 0.0021 - val_rmse: 0.0456
Epoch 24/500
3132/3132 [==============================] - 159s - loss: 0.0019 - rmse: 0.0434 - val_loss: 0.0022 - val_rmse: 0.0464
Epoch 25/500
3132/3132 [==============================] - 156s - loss: 0.0019 - rmse: 0.0428 - val_loss: 0.0020 - val_rmse: 0.0449
Epoch 26/500
3132/3132 [==============================] - 149s - loss: 0.0019 - rmse: 0.0430 - val_loss: 0.0021 - val_rmse: 0.0452
Epoch 27/500
3132/3132 [==============================] - 164s - loss: 0.0018 - rmse: 0.0427 - val_loss: 0.0023 - val_rmse: 0.0480
Epoch 28/500
3132/3132 [==============================] - 148s - loss: 0.0018 - rmse: 0.0426 - val_loss: 0.0020 - val_rmse: 0.0450
Epoch 29/500
3132/3132 [==============================] - 152s - loss: 0.0018 - rmse: 0.0417 - val_loss: 0.0020 - val_rmse: 0.0444
Epoch 30/500
3132/3132 [==============================] - 206s - loss: 0.0017 - rmse: 0.0413 - val_loss: 0.0021 - val_rmse: 0.0453
Epoch 31/500
3132/3132 [==============================] - 251s - loss: 0.0017 - rmse: 0.0413 - val_loss: 0.0019 - val_rmse: 0.0436
Epoch 32/500
3132/3132 [==============================] - 221s - loss: 0.0017 - rmse: 0.0411 - val_loss: 0.0019 - val_rmse: 0.0434
Epoch 33/500
3132/3132 [==============================] - 2450s - loss: 0.0016 - rmse: 0.0404 - val_loss: 0.0019 - val_rmse: 0.0432
Epoch 34/500
3132/3132 [==============================] - 150s - loss: 0.0017 - rmse: 0.0413 - val_loss: 0.0020 - val_rmse: 0.0440
Epoch 35/500
3132/3132 [==============================] - 177s - loss: 0.0016 - rmse: 0.0396 - val_loss: 0.0019 - val_rmse: 0.0429
Epoch 36/500
3132/3132 [==============================] - 155s - loss: 0.0016 - rmse: 0.0396 - val_loss: 0.0018 - val_rmse: 0.0422
Epoch 37/500
3132/3132 [==============================] - 158s - loss: 0.0015 - rmse: 0.0387 - val_loss: 0.0018 - val_rmse: 0.0423
Epoch 38/500
3132/3132 [==============================] - 154s - loss: 0.0015 - rmse: 0.0386 - val_loss: 0.0019 - val_rmse: 0.0438
Epoch 39/500
3132/3132 [==============================] - 155s - loss: 0.0015 - rmse: 0.0383 - val_loss: 0.0017 - val_rmse: 0.0408
Epoch 40/500
3132/3132 [==============================] - 161s - loss: 0.0014 - rmse: 0.0373 - val_loss: 0.0018 - val_rmse: 0.0421
Epoch 41/500
3132/3132 [==============================] - 161s - loss: 0.0014 - rmse: 0.0375 - val_loss: 0.0018 - val_rmse: 0.0422
Epoch 42/500
3132/3132 [==============================] - 161s - loss: 0.0014 - rmse: 0.0371 - val_loss: 0.0019 - val_rmse: 0.0430
Epoch 43/500
3132/3132 [==============================] - 163s - loss: 0.0014 - rmse: 0.0368 - val_loss: 0.0017 - val_rmse: 0.0406
Epoch 44/500
3132/3132 [==============================] - 164s - loss: 0.0013 - rmse: 0.0361 - val_loss: 0.0016 - val_rmse: 0.0394
Epoch 45/500
3132/3132 [==============================] - 162s - loss: 0.0013 - rmse: 0.0352 - val_loss: 0.0016 - val_rmse: 0.0399
Epoch 46/500
3132/3132 [==============================] - 170s - loss: 0.0013 - rmse: 0.0355 - val_loss: 0.0017 - val_rmse: 0.0412
Epoch 47/500
3132/3132 [==============================] - 156s - loss: 0.0013 - rmse: 0.0354 - val_loss: 0.0016 - val_rmse: 0.0404
Epoch 48/500
3132/3132 [==============================] - 164s - loss: 0.0012 - rmse: 0.0351 - val_loss: 0.0016 - val_rmse: 0.0399
Epoch 49/500
3132/3132 [==============================] - 159s - loss: 0.0013 - rmse: 0.0356 - val_loss: 0.0016 - val_rmse: 0.0395
Epoch 50/500
3132/3132 [==============================] - 157s - loss: 0.0013 - rmse: 0.0356 - val_loss: 0.0016 - val_rmse: 0.0398
==========
evaluating using the model that has the best loss on the valid set
Train score: 0.001245 rmse (norm): 0.035206 rmse (real): 5.908253
Test score: 0.001477 rmse (norm): 0.038426 rmse (real): 6.448677
==========
training model (cont)...
Train on 3480 samples, validate on 240 samples
Epoch 1/100
3480/3480 [==============================] - 173s - loss: 0.0013 - rmse: 0.0364 - val_loss: 0.0016 - val_rmse: 0.0394
Epoch 2/100
3480/3480 [==============================] - 179s - loss: 0.0013 - rmse: 0.0364 - val_loss: 0.0015 - val_rmse: 0.0385
Epoch 3/100
3480/3480 [==============================] - 177s - loss: 0.0014 - rmse: 0.0374 - val_loss: 0.0015 - val_rmse: 0.0388
Epoch 4/100
3480/3480 [==============================] - 185s - loss: 0.0014 - rmse: 0.0367 - val_loss: 0.0015 - val_rmse: 0.0388
Epoch 5/100
3480/3480 [==============================] - 171s - loss: 0.0013 - rmse: 0.0358 - val_loss: 0.0015 - val_rmse: 0.0391
Epoch 6/100
3480/3480 [==============================] - 163s - loss: 0.0013 - rmse: 0.0356 - val_loss: 0.0015 - val_rmse: 0.0387
Epoch 7/100
3480/3480 [==============================] - 174s - loss: 0.0013 - rmse: 0.0354 - val_loss: 0.0015 - val_rmse: 0.0382
Epoch 8/100
3480/3480 [==============================] - 225s - loss: 0.0012 - rmse: 0.0351 - val_loss: 0.0016 - val_rmse: 0.0392
Epoch 9/100
3480/3480 [==============================] - 184s - loss: 0.0012 - rmse: 0.0351 - val_loss: 0.0015 - val_rmse: 0.0380
Epoch 10/100
3480/3480 [==============================] - 185s - loss: 0.0013 - rmse: 0.0353 - val_loss: 0.0015 - val_rmse: 0.0383
Epoch 11/100
3480/3480 [==============================] - 169s - loss: 0.0012 - rmse: 0.0346 - val_loss: 0.0015 - val_rmse: 0.0390
Epoch 12/100
3480/3480 [==============================] - 166s - loss: 0.0012 - rmse: 0.0345 - val_loss: 0.0014 - val_rmse: 0.0378
Epoch 13/100
3480/3480 [==============================] - 170s - loss: 0.0012 - rmse: 0.0347 - val_loss: 0.0015 - val_rmse: 0.0387
Epoch 14/100
3480/3480 [==============================] - 166s - loss: 0.0012 - rmse: 0.0346 - val_loss: 0.0015 - val_rmse: 0.0388
Epoch 15/100
3480/3480 [==============================] - 181s - loss: 0.0012 - rmse: 0.0346 - val_loss: 0.0017 - val_rmse: 0.0414
Epoch 16/100
3480/3480 [==============================] - 182s - loss: 0.0012 - rmse: 0.0343 - val_loss: 0.0015 - val_rmse: 0.0384
Epoch 17/100
3480/3480 [==============================] - 206s - loss: 0.0012 - rmse: 0.0341 - val_loss: 0.0014 - val_rmse: 0.0376
Epoch 18/100
3480/3480 [==============================] - 171s - loss: 0.0012 - rmse: 0.0338 - val_loss: 0.0014 - val_rmse: 0.0378
Epoch 19/100
3480/3480 [==============================] - 173s - loss: 0.0011 - rmse: 0.0333 - val_loss: 0.0014 - val_rmse: 0.0373
Epoch 20/100
3480/3480 [==============================] - 198s - loss: 0.0011 - rmse: 0.0333 - val_loss: 0.0014 - val_rmse: 0.0375
Epoch 21/100
3480/3480 [==============================] - 180s - loss: 0.0012 - rmse: 0.0347 - val_loss: 0.0015 - val_rmse: 0.0383
Epoch 22/100
3480/3480 [==============================] - 160s - loss: 0.0012 - rmse: 0.0338 - val_loss: 0.0014 - val_rmse: 0.0377
Epoch 23/100
3480/3480 [==============================] - 162s - loss: 0.0011 - rmse: 0.0334 - val_loss: 0.0014 - val_rmse: 0.0372
Epoch 24/100
3480/3480 [==============================] - 161s - loss: 0.0011 - rmse: 0.0332 - val_loss: 0.0014 - val_rmse: 0.0375
Epoch 25/100
3480/3480 [==============================] - 161s - loss: 0.0011 - rmse: 0.0329 - val_loss: 0.0014 - val_rmse: 0.0379
Epoch 26/100
3480/3480 [==============================] - 160s - loss: 0.0011 - rmse: 0.0325 - val_loss: 0.0014 - val_rmse: 0.0375
Epoch 27/100
3480/3480 [==============================] - 160s - loss: 0.0011 - rmse: 0.0329 - val_loss: 0.0014 - val_rmse: 0.0374
Epoch 28/100
3480/3480 [==============================] - 160s - loss: 0.0011 - rmse: 0.0327 - val_loss: 0.0015 - val_rmse: 0.0385
Epoch 29/100
3480/3480 [==============================] - 160s - loss: 0.0011 - rmse: 0.0324 - val_loss: 0.0014 - val_rmse: 0.0375
Epoch 30/100
3480/3480 [==============================] - 162s - loss: 9.9327e-04 - rmse: 0.0314 - val_loss: 0.0013 - val_rmse: 0.0363
Epoch 31/100
3480/3480 [==============================] - 160s - loss: 0.0010 - rmse: 0.0316 - val_loss: 0.0016 - val_rmse: 0.0393
Epoch 32/100
3480/3480 [==============================] - 184s - loss: 9.8722e-04 - rmse: 0.0313 - val_loss: 0.0013 - val_rmse: 0.0363
Epoch 33/100
3480/3480 [==============================] - 184s - loss: 0.0011 - rmse: 0.0323 - val_loss: 0.0014 - val_rmse: 0.0377
Epoch 34/100
3480/3480 [==============================] - 190s - loss: 9.6553e-04 - rmse: 0.0309 - val_loss: 0.0014 - val_rmse: 0.0371
Epoch 35/100
3480/3480 [==============================] - 180s - loss: 9.8056e-04 - rmse: 0.0312 - val_loss: 0.0013 - val_rmse: 0.0365
Epoch 36/100
3480/3480 [==============================] - 192s - loss: 9.3423e-04 - rmse: 0.0305 - val_loss: 0.0013 - val_rmse: 0.0362
Epoch 37/100
3480/3480 [==============================] - 171s - loss: 9.5051e-04 - rmse: 0.0308 - val_loss: 0.0013 - val_rmse: 0.0364
Epoch 38/100
3480/3480 [==============================] - 172s - loss: 9.3468e-04 - rmse: 0.0305 - val_loss: 0.0013 - val_rmse: 0.0362
Epoch 39/100
3480/3480 [==============================] - 178s - loss: 9.0914e-04 - rmse: 0.0300 - val_loss: 0.0013 - val_rmse: 0.0364
Epoch 40/100
3480/3480 [==============================] - 165s - loss: 9.1539e-04 - rmse: 0.0302 - val_loss: 0.0014 - val_rmse: 0.0372
Epoch 41/100
3480/3480 [==============================] - 179s - loss: 9.2640e-04 - rmse: 0.0303 - val_loss: 0.0013 - val_rmse: 0.0363
Epoch 42/100
3480/3480 [==============================] - 189s - loss: 8.7358e-04 - rmse: 0.0295 - val_loss: 0.0013 - val_rmse: 0.0359
Epoch 43/100
3480/3480 [==============================] - 176s - loss: 8.8201e-04 - rmse: 0.0296 - val_loss: 0.0014 - val_rmse: 0.0372
Epoch 44/100
3480/3480 [==============================] - 179s - loss: 8.8601e-04 - rmse: 0.0297 - val_loss: 0.0013 - val_rmse: 0.0358
Epoch 45/100
3480/3480 [==============================] - 174s - loss: 8.6270e-04 - rmse: 0.0293 - val_loss: 0.0014 - val_rmse: 0.0366
Epoch 46/100
3480/3480 [==============================] - 170s - loss: 8.6026e-04 - rmse: 0.0292 - val_loss: 0.0013 - val_rmse: 0.0365
Epoch 47/100
3480/3480 [==============================] - 174s - loss: 8.6447e-04 - rmse: 0.0293 - val_loss: 0.0016 - val_rmse: 0.0400
Epoch 48/100
3480/3480 [==============================] - 204s - loss: 8.5018e-04 - rmse: 0.0291 - val_loss: 0.0013 - val_rmse: 0.0356
Epoch 49/100
3480/3480 [==============================] - 198s - loss: 8.2958e-04 - rmse: 0.0287 - val_loss: 0.0013 - val_rmse: 0.0361
Epoch 50/100
3480/3480 [==============================] - 202s - loss: 8.2710e-04 - rmse: 0.0287 - val_loss: 0.0014 - val_rmse: 0.0369
Epoch 51/100
3480/3480 [==============================] - 205s - loss: 8.4290e-04 - rmse: 0.0290 - val_loss: 0.0013 - val_rmse: 0.0364
Epoch 52/100
3480/3480 [==============================] - 200s - loss: 8.2075e-04 - rmse: 0.0286 - val_loss: 0.0013 - val_rmse: 0.0361
Epoch 53/100
3480/3480 [==============================] - 197s - loss: 8.2135e-04 - rmse: 0.0286 - val_loss: 0.0013 - val_rmse: 0.0360
Epoch 54/100
3480/3480 [==============================] - 193s - loss: 7.9838e-04 - rmse: 0.0282 - val_loss: 0.0014 - val_rmse: 0.0371
Epoch 55/100
3480/3480 [==============================] - 193s - loss: 7.9603e-04 - rmse: 0.0282 - val_loss: 0.0013 - val_rmse: 0.0365
Epoch 56/100
3480/3480 [==============================] - 190s - loss: 8.0251e-04 - rmse: 0.0282 - val_loss: 0.0015 - val_rmse: 0.0386
Epoch 57/100
3480/3480 [==============================] - 197s - loss: 8.1970e-04 - rmse: 0.0285 - val_loss: 0.0014 - val_rmse: 0.0371
Epoch 58/100
3480/3480 [==============================] - 185s - loss: 7.8108e-04 - rmse: 0.0279 - val_loss: 0.0014 - val_rmse: 0.0378
Epoch 59/100
3480/3480 [==============================] - 188s - loss: 8.2278e-04 - rmse: 0.0286 - val_loss: 0.0013 - val_rmse: 0.0363
Epoch 60/100
3480/3480 [==============================] - 190s - loss: 7.7410e-04 - rmse: 0.0277 - val_loss: 0.0014 - val_rmse: 0.0369
Epoch 61/100
3480/3480 [==============================] - 199s - loss: 7.5768e-04 - rmse: 0.0275 - val_loss: 0.0013 - val_rmse: 0.0363
Epoch 62/100
3480/3480 [==============================] - 189s - loss: 7.6622e-04 - rmse: 0.0276 - val_loss: 0.0014 - val_rmse: 0.0372
Epoch 63/100
3480/3480 [==============================] - 195s - loss: 7.7945e-04 - rmse: 0.0278 - val_loss: 0.0014 - val_rmse: 0.0370
Epoch 64/100
3480/3480 [==============================] - 185s - loss: 7.4255e-04 - rmse: 0.0272 - val_loss: 0.0013 - val_rmse: 0.0364
Epoch 65/100
3480/3480 [==============================] - 192s - loss: 7.3681e-04 - rmse: 0.0271 - val_loss: 0.0014 - val_rmse: 0.0371
Epoch 66/100
3480/3480 [==============================] - 203s - loss: 7.2934e-04 - rmse: 0.0269 - val_loss: 0.0013 - val_rmse: 0.0363
Epoch 67/100
3480/3480 [==============================] - 193s - loss: 7.3813e-04 - rmse: 0.0271 - val_loss: 0.0014 - val_rmse: 0.0370
Epoch 68/100
3480/3480 [==============================] - 196s - loss: 7.4549e-04 - rmse: 0.0272 - val_loss: 0.0014 - val_rmse: 0.0375
Epoch 69/100
3480/3480 [==============================] - 191s - loss: 7.3783e-04 - rmse: 0.0271 - val_loss: 0.0013 - val_rmse: 0.0365
Epoch 70/100
3480/3480 [==============================] - 195s - loss: 7.0260e-04 - rmse: 0.0265 - val_loss: 0.0013 - val_rmse: 0.0365
Epoch 71/100
3480/3480 [==============================] - 190s - loss: 7.1185e-04 - rmse: 0.0266 - val_loss: 0.0014 - val_rmse: 0.0369
Epoch 72/100
3480/3480 [==============================] - 189s - loss: 7.0311e-04 - rmse: 0.0265 - val_loss: 0.0014 - val_rmse: 0.0367
Epoch 73/100
3480/3480 [==============================] - 208s - loss: 7.0049e-04 - rmse: 0.0264 - val_loss: 0.0014 - val_rmse: 0.0367
Epoch 74/100
3480/3480 [==============================] - 185s - loss: 6.9289e-04 - rmse: 0.0263 - val_loss: 0.0014 - val_rmse: 0.0369
Epoch 75/100
3480/3480 [==============================] - 211s - loss: 6.7494e-04 - rmse: 0.0259 - val_loss: 0.0014 - val_rmse: 0.0367
Epoch 76/100
3480/3480 [==============================] - 211s - loss: 6.8310e-04 - rmse: 0.0261 - val_loss: 0.0014 - val_rmse: 0.0373
Epoch 77/100
3480/3480 [==============================] - 188s - loss: 6.8073e-04 - rmse: 0.0260 - val_loss: 0.0014 - val_rmse: 0.0371
Epoch 78/100
3480/3480 [==============================] - 175s - loss: 6.6299e-04 - rmse: 0.0257 - val_loss: 0.0014 - val_rmse: 0.0368
Epoch 79/100
3480/3480 [==============================] - 174s - loss: 6.5463e-04 - rmse: 0.0255 - val_loss: 0.0014 - val_rmse: 0.0370
Epoch 80/100
3480/3480 [==============================] - 181s - loss: 6.5497e-04 - rmse: 0.0255 - val_loss: 0.0014 - val_rmse: 0.0373
Epoch 81/100
3480/3480 [==============================] - 170s - loss: 6.5751e-04 - rmse: 0.0256 - val_loss: 0.0014 - val_rmse: 0.0377
Epoch 82/100
3480/3480 [==============================] - 182s - loss: 6.9720e-04 - rmse: 0.0263 - val_loss: 0.0015 - val_rmse: 0.0384
Epoch 83/100
3480/3480 [==============================] - 177s - loss: 6.7186e-04 - rmse: 0.0259 - val_loss: 0.0014 - val_rmse: 0.0370
Epoch 84/100
3480/3480 [==============================] - 185s - loss: 6.3695e-04 - rmse: 0.0252 - val_loss: 0.0014 - val_rmse: 0.0376
Epoch 85/100
3480/3480 [==============================] - 177s - loss: 6.1677e-04 - rmse: 0.0248 - val_loss: 0.0014 - val_rmse: 0.0374
Epoch 86/100
3480/3480 [==============================] - 173s - loss: 6.3652e-04 - rmse: 0.0252 - val_loss: 0.0014 - val_rmse: 0.0376
Epoch 87/100
3480/3480 [==============================] - 186s - loss: 6.2815e-04 - rmse: 0.0250 - val_loss: 0.0014 - val_rmse: 0.0373
Epoch 88/100
3480/3480 [==============================] - 186s - loss: 6.2287e-04 - rmse: 0.0249 - val_loss: 0.0016 - val_rmse: 0.0394
Epoch 89/100
3480/3480 [==============================] - 188s - loss: 6.7071e-04 - rmse: 0.0258 - val_loss: 0.0014 - val_rmse: 0.0372
Epoch 90/100
3480/3480 [==============================] - 201s - loss: 6.3318e-04 - rmse: 0.0251 - val_loss: 0.0015 - val_rmse: 0.0381
Epoch 91/100
3480/3480 [==============================] - 184s - loss: 6.1567e-04 - rmse: 0.0247 - val_loss: 0.0014 - val_rmse: 0.0375
Epoch 92/100
3480/3480 [==============================] - 589s - loss: 6.0073e-04 - rmse: 0.0245 - val_loss: 0.0014 - val_rmse: 0.0374
Epoch 93/100
3480/3480 [==============================] - 188s - loss: 5.8149e-04 - rmse: 0.0241 - val_loss: 0.0014 - val_rmse: 0.0372
Epoch 94/100
3480/3480 [==============================] - 165s - loss: 6.0592e-04 - rmse: 0.0245 - val_loss: 0.0015 - val_rmse: 0.0383
Epoch 95/100
3480/3480 [==============================] - 164s - loss: 6.0416e-04 - rmse: 0.0245 - val_loss: 0.0014 - val_rmse: 0.0375
Epoch 96/100
3480/3480 [==============================] - 163s - loss: 5.8100e-04 - rmse: 0.0240 - val_loss: 0.0014 - val_rmse: 0.0375
Epoch 97/100
3480/3480 [==============================] - 178s - loss: 5.6214e-04 - rmse: 0.0237 - val_loss: 0.0014 - val_rmse: 0.0377
Epoch 98/100
3480/3480 [==============================] - 161s - loss: 5.6168e-04 - rmse: 0.0236 - val_loss: 0.0014 - val_rmse: 0.0374
Epoch 99/100
3480/3480 [==============================] - 161s - loss: 5.6415e-04 - rmse: 0.0237 - val_loss: 0.0014 - val_rmse: 0.0377
Epoch 100/100
3480/3480 [==============================] - 164s - loss: 5.6694e-04 - rmse: 0.0238 - val_loss: 0.0015 - val_rmse: 0.0382
==========
evaluating using the final model
Train score: 0.000556 rmse (norm): 0.023555 rmse (real): 3.952934
Test score: 0.001474 rmse (norm): 0.038393 rmse (real): 6.443161